{
  "name": "Decollas",
  "firstname": "Alexandre",
  "birthdateYear": "1986",
  "birthdateMonth": "10",
  "birthdateDay": "25",
  "cv-link": "PDF cv",
  "cv": {
    "school": [
      {
        "place": "Bordeaux 1 University",
        "iconeUrl": "https://upload.wikimedia.org/wikipedia/fr/thumb/f/f2/Universit%C3%A9_Bordeaux_1_%28logo%29.svg/1200px-Universit%C3%A9_Bordeaux_1_%28logo%29.svg.png",
        "years": "2007-2012",
        "grade": "Master 2 : High Performance Computing",
        "content": "High Performance Computing consists in optimisation of massively parallel computers's programming, like super calculators. Those machines are composed of several CPUs and GPUs, all of them linked by a network.<br>This kind of programmation raises some specific problematics in performance and ressources consuming."
      }
    ],
    "professionnalJourney": [
      {
        "jobTitle": "Backend developer",
        "iconeUrl": "assets/img/logo-prestashop.png",
        "company": "Prestashop",
        "dateStart": "July 2021",
        "dateEnd": "Today",
        "place": "Bordeaux, France",
        "content": ""
      },
      {
        "jobTitle": "Lead développeur / Scrum Master",
        "iconeUrl": "assets/img/logo-moonda.jpg",
        "company": "Moonda",
        "dateStart": "Febrary 2021",
        "dateEnd": "June 2021",
        "place": "Bordeaux, France",
        "content": "Emergency start of mission in a first time, vital for the company to release the project for the main client.\n<ul>\n  <li>lead on some important topics</li>\n  <li>onboarding of new comers</li>\n</ul>\nOnce project is on line, design of the new topology making the team and process more efficient :\n<ul>\n<li>(real) agile process</li>\n<li>E2E tests (Cucumber/puppeteer) to assist the one QA of the team</li>\n<li>JS test framework migrated on Jest</li>\n<li>Development of new features</li>\n</ul>\nDaily collaboration with foreigners (Russians, Ukrainians), fluent english\n\nSupport for the junior and good practice transmission (TDD, unit testing basics, clean code...)"
      },
      {
        "jobTitle": "Developer",
        "iconeUrl": "assets/img/logo-dedalus.png",
        "company": "Dedalus",
        "dateStart": "June 2020",
        "dateEnd": "january 2021",
        "place": "Bordeaux, France",
        "content": "Multiple angle mission :<ul><li>After a release, period to make refacto and code quality improvement, bugfixes for the team. So I developed my knowledge on the project.</li><li>Improvement I've done in the project :<ul><li>make the team goes on Git and its workflow (previously on svn)</li><li>migrate the js unit testing framework (Karma to Jest)</li><li>modularization of the project so then it becomes easily testable</li><li>the UT coverage were null, so I built the ut base structure for each service and components</li><li>push the team to use good practice, as clean code, ut, so then refacto in the project would become faisable, making the project more flexible and its improvement more serene</li></ul></li><li>Complete refacto of a node app making pdf with puppeteer, calling the project.<ul><li>optimizing performances (parallelization)</li><li>jest for unit testing</li><li>dependency injection with InversifyJS</li><li>POC to choose the right lib to print the PDF/A pdfs (choice : PDFTron)</li></ul></ul>"
      },
      {
        "jobTitle": "Lead Developer",
        "iconeUrl": "assets/img/logo-maincare.png",
        "company": "Maincare Solutions",
        "dateStart": "November 2019",
        "dateEnd": "April 2020",
        "place": "Bordeaux, France",
        "content": "Maincare has rescently bought a company named IdeoIn based in Dijon, France. This company developed its own framework. Maincare Board decided to use this framework to produce software. Framework team is in Dijon, and at the start of the mission it was very laborious to communicate with them, and so was it to learn.<br>\nThe aim of the mission was to understand this framework, develop POCs (Proof of Concepts) with it, and then bring the knowledge to the team in order to produce software.<br>\n\nThis mission has been executed throw several parts :<br>\n<ul>\n    <li>\n        Technical part :\n        <ul>\n            <li>\n                Identify some blocking points linked to the framework, preventing the team to efficiently  reach the dead lines.\n            </li>\n            <li>\n                Developing with success some POCs getting around these blocking points. With the support of the hierarchy, decision is made to modify deeply the way the framework is used in the project, however compatible with it.\n            </li>\n            <li>\n                Update historical development flow : From a big front/back coupled monolith to a new flow in pure vueJS (full typescript, unit tested with Jest). The backend were also cleaned and refactored (setup of JUnit, big decoupling with front, its components lib and the backend)            </li>\n        </ul>\n    </li>\n    <li>\n        Lead part : Helping team to learn good practices (and the beginning 2 and then 5 devs), learn how to use the historical framework and then how to develop with the new approach (big point of attention on clean code, especially clean naming, SOLID principles,\n        TDD and peer programming).\n    </li>\n    <li>\n        Miscellaneous part :\n        <ul>\n            <li>\n                Participation to CI/CD chaining.\n            </li>\n            <li>\n                Restart of the communication with Dijon teams, which has partially succeeded.\n            </li>\n        </ul>\n    </li>\n</ul>\n\n"
      },
      {
        "jobTitle": "Developer and associate",
        "iconeUrl": "assets/img/zyps.png",
        "company": "Zyps",
        "dateStart": "June 2019",
        "dateEnd": "March 2020",
        "place": "Bordeaux, France",
        "content": "Startup in side project, aiming to protect intellectual property on the internet. Participating to the frontend part of the MVP."
      },
      {
        "jobTitle": "Developer",
        "iconeUrl": "assets/img/logo-betclic.png",
        "company": "Betclic Group",
        "dateStart": "April 2018",
        "dateEnd": "November 2019",
        "place": "Bordeaux, France",
        "content": "Mission splited in 2 parts :\n<ul>\n    <li>\n        In the expert team, developping features for the \"Core\" Betclic app, and for the release of new regulations and country versions (Angular 5/6/7, Karma). Internationnal context (english were the daily langage)\n    </li>\n    <li>\n        From February, starting front end development  of a new casino brand from scratch (angular 7)\n    </li>\n</ul>\n\n    Important technical points :\n\n<ul>\n    <li>\n        Use RxJS with big attention point to memory leaks.\n    </li>\n    <li>\n        Clean code, SOLID principles, unit tests (TDD) are the bases of the dev\n    </li>\n    <li>\n        Peer Programming frequently practiced\n    </li>\n    <li>\n        Pure agility: user stories, prepared in collaboration with the Product Owner, during 2 weeks long sprints\n    </li>\n</ul>\n"
      },
      {
        "jobTitle": "Lead developer",
        "iconeUrl": "assets/img/logo-lbp.png",
        "company": "Banque Postale",
        "dateStart": "December 2017",
        "dateEnd": "March 2018",
        "place": "Bordeaux, France",
        "content": "Creating a password management app, today used by interns. I did this app from scratch, fronted and backend.\n<ul>\n    <li>\n        I developed REST services based on the requirement, in Spring Framework (OpenDJ for the LDAP) and using TDD.\n    </li>\n    <li>\n        Angular 4 front side\n    </li>\n</ul>\nParticipating as a lead dev to the refactoring of the main Banque Postale applicative portal, used by agents in banks.\n<ul>\n    <li>\n        Frontend in Angular 5\n    </li>\n    <li>\n        Backend in Spring\n    </li>\n    <li>\n        Development context : team were in Paris, with junior profils. I had to help them for the development and good practices.\n    </li>\n</ul>\n"
      },
      {
        "jobTitle": "Developer",
        "iconeUrl": "assets/img/logo-lbp.png",
        "company": "Banque Postale",
        "dateStart": "April 2017",
        "dateEnd": "November 2017",
        "place": "Bordeaux, France",
        "content": "Participated to the developpement of the applicative portal used in the Bank (product side).\n<ul>\n    <li>\n        Fronted was developed in  FwAD, a BP own developped framework using mostly AngularJS concepts\n    </li>\n    <li>\n        Backend part : REST services developed in java, with Spring Boot and Maven.\n    </li>\n    <li>\n        One of the challenge of this mission was the extensive knowledge to master. The dev were in Semi Agile in a massively multi teams and multi layers context.\n    </li>\n</ul>\n"
      },
      {
        "jobTitle": "Developer",
        "iconeUrl": "assets/img/logo-edf.png",
        "company": "EDF",
        "dateStart": "November 2016",
        "dateEnd": "March 2017",
        "place": "Bordeaux, France",
        "content": "Developpement of HMI POC for Electricity of France (EDF) who wanted to abandon its old and obsolete java applets. EDF wanted a brand new modern way to exploit its very big amount of data in order to daily adjust its electric building around the country.\n<ul>\n    <li>\n        Developed in just released Angular2, and then rebuilt all in React frontend side (due to a radical change in tech direction, mid term), unit tested (Karma)\n    </li>\n    <li>\n        REST services developed in the backend.\n    </li>\n    <li>\n        Java with Spring Data on  Apache JBoss\n    </li>\n    <li>\n        A side aim of this project was for EDF to test pure agility, what they didn't used to practice. So the project were helped with 3 agile coaches, and so, in pure Agile (2 weeks sprints, User Story estimated in Poker planning and defined in Grooming session etc).\n    </li>\n</ul>\n"
      },
      {
        "jobTitle": "Developer",
        "iconeUrl": "assets/img/logo-CRA.png",
        "company": "Conseil régional Aquitaine (Aquitaine Regional Council)",
        "dateStart": "May 2015",
        "dateEnd": "October 2016",
        "place": "Bordeaux, France",
        "content": "Developement of features in the refacto of the legacy Aquitaine Regional Concil portal (used by 4000 users).\n<ul>\n    <li>\n      Important legacy part, in Java/J2EE. Framework : Struts 1.2, Postgresql.\n    </li>\n    <li>\n        Developement of features for frontend in js/css/html, with graphical contracts to tackle.\n    </li>\n</ul>\n"
      },
      {
        "jobTitle": "Developer",
        "company": "Orange",
        "iconeUrl": "assets/img/logo-orange.png",
        "dateStart": "September 2015",
        "dateEnd": "April 2016",
        "place": "Bordeaux, France",
        "content": "<ul>\n    <li>\n        Developing features for the internal portal (used by 200 users)\n    </li>\n    <li>\n        Developed in PHP/Zend2 with MySQL. \n    </li>\n    <li>\n        Modifications on the front, using JavaScript ans CSS, graphic contract, AJAX call management\n    </li>\n</ul>"
      },
      {
        "jobTitle": "Developer",
        "iconeUrl": "assets/img/logo-pj.png",
        "company": "Pages Jaunes, Solocal group",
        "dateStart": "Février 2014",
        "dateEnd": "August 2015",
        "place": "Bordeaux, France",
        "content": "<ul>\n    <li>\n        Manually performed operations automation\n    </li>\n    <li>\n        Automation of a part of the data integration toolchain.\n    </li>\n    <li>\n        Developed in Java with SWING interface, using Excel API (Apache POI) and Oracle SGBD API\n    </li>\n    <li>\n        Excel Macros written in VBA, aiming to increase the data integration speed process.\n    </li>\n</ul>\n"
      },
      {
        "jobTitle": "Developer",
        "iconeUrl": "assets/img/logo-primobox.png",
        "company": "Primobox",
        "dateStart": "December 2012",
        "dateEnd": "December 2013",
        "place": "Bordeaux, France",
        "content": "Primobox aims to develop a HR portal in SaaS.\n<ul>\n    <li>\n        Developping features in J2EE to develop business needs, in pseudo Agility.\n    </li>\n    <li>\n        Setup a monitoring solution for servers state monitoring, with Nagios.   </li>\n</ul>\n"
      }
    ],
    "moreExperiences": "See more..."
  },
  "mainMenu": {
    "journey": "Experience",
    "petProjects": "Projects",
    "blog": "Blog",
    "contact": "Contact",
    "translateTo": "Français"
  },
  "intro": {
    "title": "\"Business Value Driven\"",
    "punchLine": "#Development #Passion #Business #TechnoEnthousiast",
    "knowMore": "More informations",
    "content": [
      "Hi, I'm Alexandre Decollas, 35. After 9 years of experience in development industry, I started by passion for sciences and IT to a passion for beautiful code especially and what it brings to the business.",
      "I always aim my action in client business point of view. Actually, what point makes the dev if he doesn't bring value?",
      "That's why I want to reach the approach \"Software Craftman\" defined by Sandro Mancuso. Practicing TDD (Test Driven Development) is for me as important as the communication with different project characters. I've acquire the deep conviction that the developer action as an adviser, communicator and technician grants a higher chance for the project to perform a good progress.",
      "In such a domain, up-to-date knowledge is a critical point. It brings a lot of value to the developer. That's why I look regularly tutorials, conferences, articles... My bedside books are either generalists (The software craftmanship, Clean Code, Clean Architecture etc) or more technicals (spring in action, TDD by example etc). I aim to maintain my skills updated. It allows me to have the choice of the approach when I need to tackle a problem. At the right moment, I can choose the best.",
      "During my career, I had occasion to endorse lead dev role. I discovered that I love to transmit my knowledge. It's an important part of the job, and it pushes to increase my knowledge. \"To teach is to learn twice\" - Joseph Joubert"
    ]
  },
  "petProjects": [
    {
      "title": "Base n calculator",
      "description": "Base n calculator, allowing to add 2 base 5 numbers if you want (spoil : converts in base 10 and then reconvert in origin base). (Python, in TDD)",
      "url": "https://github.com/AlexandreDecollas/calculator_base_n"
    },
    {
      "title": "Monty Hall Experiment",
      "url": "https://github.com/AlexandreDecollas/montyHallParadox",
      "description": "The result was so counter intuitive that I wanted to verify by myself. (Java, in TDD)"
    },
    {
      "title": "Google SearchResult Key Navigation",
      "url": "https://github.com/AlexandreDecollas/GoogleSearchResultKeyNavigation",
      "description": "Chrome extention aimaing to navigate throw google search results with keys. (Typescript, in TDD)"
    }
  ],
  "contact": {
    "title": "Contact",
    "intro": "Did you like it? Let's get in touch!",
    "email": "alexandre.decollas.pro@gmail.com",
    "twitter": "https://twitter.com/alex_decollas",
    "linkedin": "https://www.linkedin.com/in/alexandre-decollas/",
    "github": "https://github.com/AlexandreDecollas"
  },
  "footer": {
    "cvLinkText": "Git repository of this CV",
    "cvLinkUrl": "https://github.com/AlexandreDecollas/cv"
  }
}
